[
    {
      "title": "Birinci Kelime (Tayyib)",
      "arabic": "لَا إِلٰهَ إِلَّا اللهُ مُحَمَّدٌ رَسُولُ اللهِ",
      "translation": "Allah'tan başka ilah yoktur, Muhammed Allah'ın elçisidir."
    },
    {
      "title": "İkinci Kelime (Şehadet)",
      "arabic": "أَشْهَدُ أَنْ لَا إِلٰهَ إِلَّا اللهُ وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ",
      "translation": "Allah'tan başka ilah olmadığına, Muhammed'in Allah'ın kulu ve elçisi olduğuna şehadet ederim."
    },
    {
      "title": "Üçüncü Kelime (Temcid)",
      "arabic": "سُبْحَانَ اللهِ وَالْحَمْدُ لِلَّهِ وَلَا إِلٰهَ إِلَّا اللهُ وَاللهُ أَكْبَرُ وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللهِ الْعَلِيِّ الْعَظِيمِ",
      "translation": "Allah'ı tenzih ederim, hamd Allah'adır, Allah'tan başka ilah yoktur, Allah en büyüktür. Allah'tan başka güç ve kuvvet yoktur, yüce ve büyük Allah'a aittir."
    },
    {
      "title": "Dördüncü Kelime (Tevhid)",
      "arabic": "لَا إِلٰهَ إِلَّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ يُحْيِي وَيُمِيتُ وَهُوَ حَيٌّ لَا يَمُوتُ أَبَدًا أَبَدًا ذُو الْجَلَالِ وَالْإِكْرَامِ بِيَدِهِ الْخَيْرُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ",
      "translation": "Allah'tan başka ilah yoktur. O tektir, ortağı yoktur. Mülk ve hamd O'na aittir. O diriltir ve öldürür. O, ebedi olarak ölmeyen Hayy'dır. Celal ve ikram sahibidir. Hayır O'nun elindedir. O her şeye kadirdir."
    },
    {
      "title": "Beşinci Kelime (İstiğfar)",
      "arabic": "أَسْتَغْفِرُ اللهَ رَبِّي مِنْ كُلِّ ذَنْبٍ أَذْنَبْتُهُ عَمْدًا أَوْ خَطَأً سِرًّا أَوْ عَلَانِيَةً وَأَتُوبُ إِلَيْهِ مِنَ الذَّنْبِ الَّذِي أَعْلَمُ وَمِنَ الذَّنْبِ الَّذِي لَا أَعْلَمُ إِنَّكَ أَنْتَ عَلَّامُ الْغُيُوبِ وَسَتَّارُ الْعُيُوبِ وَغَفَّارُ الذُّنُوبِ وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللهِ الْعَلِيِّ الْعَظِيمِ",
      "translation": "Bilerek veya bilmeyerek işlediğim her türlü günahımdan dolayı Rabbim Allah'tan mağfiret dilerim. İşlediğim günahlardan tövbe ederim, bildiğim günahlar ve bilmediğim günahlardan ötürü. Ey bütün sırları bilen, günahları örten ve günahları bağışlayan! Kuvvet ve kudret sadece yüce ve büyük Allah'a aittir."
    },
    {
      "title": "Altıncı Kelime (Redd-i Küfür)",
      "arabic": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ أَنْ أُشْرِكَ بِكَ شَيْئًا وَأَنَا أَعْلَمُ وَأَسْتَغْفِرُكَ لِمَا لَا أَعْلَمُ تُبْتُ عَنْهُ وَتَبَرَّأْتُ مِنَ الْكُفْرِ وَالشِّرْكِ وَالْكِذْبِ وَالْغِيبَةِ وَالْبِدْعَةِ وَالنَّمِيمَةِ وَالْفَوَاحِشِ وَالْبُهْتَانِ وَالْمَعَاصِي كُلِّهَا وَأَسْلَمْتُ وَأَقُولُ لَا إِلٰهَ إِلَّا اللهُ مُحَمَّدٌ رَسُولُ اللهِ",
      "translation": "Allah'ım! Bilerek şirk koşmaktan sana sığınırım. Bilmeden yaptıklarım için senden af dilerim. Kafirlikten, şirke düşmekten, yalan söylemekten, gıybet etmekten, bidattan, iftiradan, fuhuştan ve bütün günahlardan uzak durarak tövbe ederim. Müslüman olarak teslim olurum ve derim ki: Allah'tan başka ilah yoktur, Muhammed Allah'ın elçisidir."
    }
  ]
  