[
  {
    "title": "Morning Azkar",
    "dua": "اللّهُـمَّ أَنْتَ رَبِّـي لا إلهَ إلاّ أَنْتَ، خَلَقْتَنـي وَأَنا عَبْـدُكَ، وَأَنا عَلـى عَهْـدِكَ وَوَعْدِكَ مَا اسْتَطَـعْتُ، أَعـوذُ بِكَ مِنْ شَـرِّ ما صَنَـعْتُ، أَبـوءُ لَكَ بِنِعْـمَتِكَ عَلَـيَّ وَأَبـوءُ بِذَنْـبي فَاغْفِـرْ لي فَإِنَّهُ لا يَغْفِرُ الذُّنـوبَ إِلاّ أَنْتَ.",
    "translation": "O Allah, You are my Lord, there is no deity but You. You created me and I am Your servant, and I abide by Your covenant and promise as best as I can. I seek refuge in You from the evil of what I have done. I acknowledge Your favor upon me, and I acknowledge my sin. So forgive me, for indeed, none forgives sins except You.",
    "benefits": "Protection from harm and guidance for the day.",
    "time_to_recite": "Morning"
  },
  {
    "title": "Evening Azkar",
    "dua": "اللّهُـمَّ إِنِّـي أَمْسَـيتُ أُشْهِـدُك وَأُشْهِـدُ حَمَلَـةَ عَرْشِكَ، وَمَلائِكَتَـكَ، وَجَمِيعَ خَلْقِكَ، أَنَّكَ أَنْتَ اللّهُ لا إِلـهَ إِلاّ أَنْتَ وَحْدَكَ لا شَرِيـكَ لَكَ وَأَنَّ مُحَـمَّداً عَبْدُكَ وَرَسُولُـكَ.",
    "translation": "O Allah, I have entered this evening and call upon You, the bearers of Your Throne, Your angels, and all of Your creation to witness that You are Allah, none has the right to be worshiped except You, alone, without partner, and that Muhammad is Your servant and Messenger.",
    "benefits": "Peace and tranquility throughout the night.",
    "time_to_recite": "Evening"
  },
  {
    "title": "Before Sleep",
    "dua": "بِاسْمِكَ اللّهُمَّ أَمُوتُ وَأَحْيَا",
    "translation": "In Your name, O Allah, I die and I live.",
    "benefits": "Safety during sleep and peaceful rest.",
    "time_to_recite": "Before Sleep"
  },
  {
    "title": "After Fajr Prayer",
    "dua": "اللّهُـمَّ إِنِّـي أَسْأَلُـكَ عِـلْماً نَافِـعاً، وَرِزْقاً طَيِّـباً، وَعَمَـلاً مُتَقَبَّـلاً.",
    "translation": "O Allah, I ask You for beneficial knowledge, good provision, and deeds that will be accepted.",
    "benefits": "Spiritual growth and divine guidance.",
    "time_to_recite": "After Fajr Prayer"
  },
  {
    "title": "Leaving the House",
    "dua": "بِسْمِ اللّهِ تَوَكَّلْتُ عَلَى اللّهِ، وَلاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللّهِ.",
    "translation": "In the name of Allah, I place my trust in Allah, and there is no power and no strength except with Allah.",
    "benefits": "Protection from harm and guidance throughout the day.",
    "time_to_recite": "When leaving the house"
  },
  {
    "title": "Before Entering the Toilet",
    "dua": "اللّهُـمَّ إِنِّـي أَعُـوذُ بِكَ مِنَ الخُبْثِ وَالخَبَائِثِ.",
    "translation": "O Allah, I seek refuge with You from all evil and evil-doers.",
    "benefits": "Protection from harm and impurity.",
    "time_to_recite": "Before entering the toilet"
  },
  {
    "title": "After Exiting the Toilet",
    "dua": "غُفْرَانَك",
    "translation": "I seek Your forgiveness.",
    "benefits": "Seeking forgiveness for any shortcomings.",
    "time_to_recite": "After exiting the toilet"
  },
  {
    "title": "Before Eating",
    "dua": "بِسْمِ اللَّهِ وَبَرَكَاتِهِ",
    "translation": "In the name of Allah and with His blessings.",
    "benefits": "Blessings in food and prevention from harm.",
    "time_to_recite": "Before starting a meal"
  },
  {
    "title": "After Eating",
    "dua": "الْحَمْدُ لِلَّهِ الَّذِي أَطْعَمَنَا وَسَقَانَا وَجَعَلَنَا مُسْلِمِينَ",
    "translation": "Praise be to Allah who has given us food and drink and made us Muslims.",
    "benefits": "Gratitude and blessings for the provision.",
    "time_to_recite": "After finishing a meal"
  },
  {
    "title": "Waking Up",
    "dua": "الْحَمْدُ لِلَّهِ الَّذِي أَحْيَانَا بَعْدَ مَا أَمَاتَنَا وَإِلَيْهِ النُّشُورُ",
    "translation": "All praise is due to Allah, who revived us after causing us to die, and unto Him is the resurrection.",
    "benefits": "Gratitude and spiritual awareness.",
    "time_to_recite": "Immediately after waking up"
  },
  {
    "title": "When Facing Difficulties",
    "dua": "حَسْبُنَا اللَّهُ وَنِعْمَ الْوَكِيلُ",
    "translation": "Allah is sufficient for us, and He is the best disposer of affairs.",
    "benefits": "Reliance on Allah and relief from difficulties.",
    "time_to_recite": "During times of distress or hardship"
  },
  {
    "title": "When Entering the Mosque",
    "dua": "اللَّهُمَّ افْتَحْ لِي أَبْوَابَ رَحْمَتِكَ",
    "translation": "O Allah, open for me the doors of Your mercy.",
    "benefits": "Seeking mercy and blessings in worship.",
    "time_to_recite": "Before entering the mosque"
  },
  {
    "title": "When Leaving the Mosque",
    "dua": "اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ فَضْلِكَ",
    "translation": "O Allah, I ask You for Your bounty.",
    "benefits": "Seeking Allah’s favor in daily affairs.",
    "time_to_recite": "Upon exiting the mosque"
  },
  {
    "title": "Before Studying",
    "dua": "اللَّهُمَّ انْفَعْنِي بِمَا عَلَّمْتَنِي وَعَلِّمْنِي مَا يَنْفَعُنِي وَزِدْنِي عِلْمًا",
    "translation": "O Allah, benefit me with what You have taught me, teach me what will benefit me, and increase me in knowledge.",
    "benefits": "Seeking knowledge and understanding.",
    "time_to_recite": "Before starting to study or learn"
  },
  {
    "title": "During Travel",
    "dua": "سُبْحَانَ الَّذِي سَخَّرَ لَنَا هَذَا وَمَا كُنَّا لَهُ مُقْرِنِينَ وَإِنَّا إِلَىٰ رَبِّنَا لَمُنقَلِبُونَ",
    "translation": "Glory to Him who has subjected this (transport) to us, and we could never have it by our efforts. And surely, to our Lord, we must return.",
    "benefits": "Protection and guidance during travel.",
    "time_to_recite": "At the beginning of a journey"
  },
  {
    "title": "When in Distress",
    "dua": "اللّهُ اللّهُ رَبِّـي لا أُشْـرِكُ بِهِ شَيْـئاً",
    "translation": "Allah, Allah is my Lord; I do not associate anything with Him.",
    "benefits": "Relief from anxiety and worries.",
    "time_to_recite": "In times of distress or anxiety"
  }
]
