[
    {
      "title": "صبح کے اذکار",
      "dua": "اللّهُـمَّ أَنْتَ رَبِّـي لا إلهَ إلاّ أَنْتَ، خَلَقْتَنـي وَأَنا عَبْـدُكَ، وَأَنا عَلـى عَهْـدِكَ وَوَعْدِكَ مَا اسْتَطَـعْتُ، أَعـوذُ بِكَ مِنْ شَـرِّ ما صَنَـعْتُ، أَبـوءُ لَكَ بِنِعْـمَتِكَ عَلَـيَّ وَأَبـوءُ بِذَنْـبي فَاغْفِـرْ لي فَإِنَّهُ لا يَغْفِرُ الذُّنـوبَ إِلاّ أَنْتَ.",
      "translation": "اے اللہ! تو میرا رب ہے، تیرے سوا کوئی معبود نہیں۔ تو نے مجھے پیدا کیا اور میں تیرا بندہ ہوں۔ میں اپنی طاقت کے مطابق تیرے عہد اور وعدے پر قائم ہوں۔ میں اپنے کیے کے شر سے تیری پناہ مانگتا ہوں۔ میں تیرے احسان کو تسلیم کرتا ہوں اور اپنے گناہ کو بھی مانتا ہوں، لہٰذا مجھے معاف فرما، کیونکہ تیرے سوا کوئی گناہوں کو معاف نہیں کرتا۔",
      "benefits": "نقصان سے حفاظت اور دن کے لیے رہنمائی۔",
      "time_to_recite": "صبح"
    },
    {
      "title": "شام کے اذکار",
      "dua": "اللّهُـمَّ إِنِّـي أَمْسَـيتُ أُشْهِـدُك وَأُشْهِـدُ حَمَلَـةَ عَرْشِكَ، وَمَلائِكَتَـكَ، وَجَمِيعَ خَلْقِكَ، أَنَّكَ أَنْتَ اللّهُ لا إِلـهَ إِلاّ أَنْتَ وَحْدَكَ لا شَرِيـكَ لَكَ وَأَنَّ مُحَـمَّداً عَبْدُكَ وَرَسُولُـكَ.",
      "translation": "اے اللہ! میں نے شام کو تیری گواہی دی اور تیرے عرش کے حامل فرشتوں، تیرے تمام فرشتوں اور تمام مخلوقات کو گواہ بنایا کہ تو ہی اللہ ہے، تیرے سوا کوئی معبود نہیں، اور محمد تیرے بندے اور رسول ہیں۔",
      "benefits": "رات بھر سکون اور اطمینان۔",
      "time_to_recite": "شام"
    },
    {
      "title": "سونے سے پہلے",
      "dua": "بِاسْمِكَ اللّهُمَّ أَمُوتُ وَأَحْيَا",
      "translation": "اے اللہ، تیرے نام کے ساتھ میں مرتا ہوں اور جیتا ہوں۔",
      "benefits": "نیند کے دوران حفاظت اور پر سکون آرام۔",
      "time_to_recite": "سونے سے پہلے"
    },
    {
      "title": "فجر کی نماز کے بعد",
      "dua": "اللّهُـمَّ إِنِّـي أَسْأَلُـكَ عِـلْماً نَافِـعاً، وَرِزْقاً طَيِّـباً، وَعَمَـلاً مُتَقَبَّـلاً.",
      "translation": "اے اللہ! میں تجھ سے نفع بخش علم، پاکیزہ رزق، اور قبول شدہ عمل کا سوال کرتا ہوں۔",
      "benefits": "روحانی ترقی اور الٰہی رہنمائی۔",
      "time_to_recite": "فجر کی نماز کے بعد"
    },
    {
      "title": "گھر سے نکلتے وقت",
      "dua": "بِسْمِ اللّهِ تَوَكَّلْتُ عَلَى اللّهِ، وَلاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللّهِ.",
      "translation": "اللہ کے نام کے ساتھ، میں نے اللہ پر بھروسہ کیا، اور اللہ کے سوا کوئی طاقت اور قوت نہیں۔",
      "benefits": "نقصان سے حفاظت اور دن بھر رہنمائی۔",
      "time_to_recite": "گھر سے نکلتے وقت"
    },
    {
      "title": "بیت الخلاء میں داخل ہونے سے پہلے",
      "dua": "اللّهُـمَّ إِنِّـي أَعُـوذُ بِكَ مِنَ الخُبْثِ وَالخَبَائِثِ.",
      "translation": "اے اللہ! میں تجھ سے ہر برائی اور برے لوگوں سے پناہ مانگتا ہوں۔",
      "benefits": "نقصان اور ناپاکی سے حفاظت۔",
      "time_to_recite": "بیت الخلاء میں داخل ہونے سے پہلے"
    },
    {
      "title": "بیت الخلاء سے نکلنے کے بعد",
      "dua": "غُفْرَانَك",
      "translation": "میں تیری معافی مانگتا ہوں۔",
      "benefits": "کمیوں کی معافی مانگنا۔",
      "time_to_recite": "بیت الخلاء سے نکلنے کے بعد"
    },
    {
      "title": "کھانا کھانے سے پہلے",
      "dua": "بِسْمِ اللَّهِ وَبَرَكَاتِهِ",
      "translation": "اللہ کے نام کے ساتھ اور اس کی برکتوں کے ساتھ۔",
      "benefits": "کھانے میں برکت اور نقصان سے بچاؤ۔",
      "time_to_recite": "کھانا شروع کرنے سے پہلے"
    },
    {
      "title": "کھانا کھانے کے بعد",
      "dua": "الْحَمْدُ لِلَّهِ الَّذِي أَطْعَمَنَا وَسَقَانَا وَجَعَلَنَا مُسْلِمِينَ",
      "translation": "تمام تعریفیں اللہ کے لیے ہیں جس نے ہمیں کھانا اور پانی دیا اور ہمیں مسلمان بنایا۔",
      "benefits": "رزق کے لیے شکر اور برکتیں۔",
      "time_to_recite": "کھانا ختم کرنے کے بعد"
    },
    {
      "title": "جاگنے کے بعد",
      "dua": "الْحَمْدُ لِلَّهِ الَّذِي أَحْيَانَا بَعْدَ مَا أَمَاتَنَا وَإِلَيْهِ النُّشُورُ",
      "translation": "تمام تعریفیں اللہ کے لیے ہیں جس نے ہمیں مرنے کے بعد زندہ کیا، اور اسی کی طرف اٹھایا جانا ہے۔",
      "benefits": "شکر گزاری اور روحانی آگاہی۔",
      "time_to_recite": "جاگنے کے فوراً بعد"
    },
    {
      "title": "مشکل حالات میں",
      "dua": "حَسْبُنَا اللَّهُ وَنِعْمَ الْوَكِيلُ",
      "translation": "اللہ ہمارے لیے کافی ہے، اور وہ بہترین کام بنانے والا ہے۔",
      "benefits": "اللہ پر بھروسہ اور مشکلات سے نجات۔",
      "time_to_recite": "مصیبت کے وقت"
    },
    {
      "title": "مسجد میں داخل ہوتے وقت",
      "dua": "اللَّهُمَّ افْتَحْ لِي أَبْوَابَ رَحْمَتِكَ",
      "translation": "اے اللہ، میرے لیے اپنی رحمت کے دروازے کھول دے۔",
      "benefits": "عبادت میں رحمت اور برکت مانگنا۔",
      "time_to_recite": "مسجد میں داخل ہونے سے پہلے"
    },
    {
      "title": "مسجد سے نکلتے وقت",
      "dua": "اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ فَضْلِكَ",
      "translation": "اے اللہ، میں تجھ سے تیرا فضل مانگتا ہوں۔",
      "benefits": "روزمرہ کے امور میں اللہ کا فضل مانگنا۔",
      "time_to_recite": "مسجد سے نکلتے وقت"
    },
    {
      "title": "پڑھائی شروع کرنے سے پہلے",
      "dua": "اللَّهُمَّ انْفَعْنِي بِمَا عَلَّمْتَنِي وَعَلِّمْنِي مَا يَنْفَعُنِي وَزِدْنِي عِلْمًا",
      "translation": "اے اللہ! مجھے جو کچھ تو نے سکھایا ہے، اس سے مجھے نفع پہنچا، اور مجھے وہ علم سکھا جو مجھے نفع دے، اور میرے علم میں اضافہ فرما۔",
      "benefits": "علم اور فہم کی طلب۔",
      "time_to_recite": "پڑھائی یا سیکھنے سے پہلے"
    },
    {
      "title": "دکان میں داخل ہوتے وقت",
      "dua": "اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ فَضْلِكَ",
      "translation": "اے اللہ، میں تجھ سے تیرا فضل مانگتا ہوں۔",
      "benefits": "رزق اور برکت کی دعا۔",
      "time_to_recite": "دکان یا مارکیٹ میں داخل ہونے سے پہلے"
    },
    {
      "title": "دکان سے نکلتے وقت",
      "dua": "بِسْمِ اللَّهِ تَوَكَّلْتُ عَلَى اللَّهِ وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ",
      "translation": "اللہ کے نام کے ساتھ، میں نے اللہ پر بھروسہ کیا، اور اللہ کے سوا کوئی طاقت اور قوت نہیں۔",
      "benefits": "محفوظ رہنا اور فائدہ حاصل کرنا۔",
      "time_to_recite": "دکان یا مارکیٹ سے نکلتے وقت"
    }
  ]
  